Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70J19.atdf
          <instance name="UART2">
            <register-group address-space="base" name="UART2" name-in-module="UART" offset="0x400E1A00"/>
            <signals>
              <signal pad="PD25" function="C" group="URXD" index="2"/>
              <signal pad="PD26" function="C" group="UTXD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="25"/>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="INSTANCE_ID" value="44"/>
            </parameters>
          </instance>
        </module>
        <module name="USART" id="6089" version="ZQ">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PB2" function="C" group="CTS" index="0"/>
              <signal pad="PD0" function="D" group="DCD" index="0"/>
              <signal pad="PD2" function="D" group="DSR" index="0"/>
              <signal pad="PD1" function="D" group="DTR" index="0"/>
              <signal pad="PD3" function="D" group="RI" index="0"/>
              <signal pad="PB3" function="C" group="RTS" index="0"/>
              <signal pad="PB0" function="C" group="RXD" index="0"/>
              <signal pad="PB13" function="C" group="SCK" index="0"/>
              <signal pad="PB1" function="C" group="TXD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="INSTANCE_ID" value="13"/>
            </parameters>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40028000"/>
            <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA26" function="A" group="DCD" index="1"/>
              <signal pad="PA28" function="A" group="DSR" index="1"/>
              <signal pad="PA27" function="A" group="DTR" index="1"/>
              <signal pad="PA3" function="B" group="LONCOL" index="1"/>
              <signal pad="PA29" function="A" group="RI" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PB4" function="D" group="TXD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="INSTANCE_ID" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="USBHS" id="11292" version="D">
          <instance name="USBHS">
            <register-group address-space="base" name="USBHS" name-in-module="USBHS" offset="0x40038000"/>
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="UTMI" id="11300" version="A">
          <instance name="UTMI">
            <register-group address-space="base" name="UTMI" name-in-module="UTMI" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="WDT" id="6080" version="J">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="G">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40078000"/>
            <parameters>
              <param name="INSTANCE_ID" value="58"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="D">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="30"/>
              <param name="INSTANCE_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="SCnSCB"> <!-- System control Register not in SCB -->
            <instance name="SCnSCB">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SCnSCB" name="SCnSCB"/>
            </instance>
        </module><module name="SCB">
            <instance name="SCB" oldname="SystemControl">
                <register-group address-space="base" offset="0xE000ED00" name-in-module="SCB" name="SCB"/>
            </instance>
        </module>
        <module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module>
        <module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
