Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70J19.atdf
      <value-group caption="" name="XDMAC_CNDC23__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC23__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC23__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__SIF">
        <value caption="The data is read through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__DIF">
        <value caption="The data is written through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC23__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
    </module>
    <module name="FUSES" id="1" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="GPNVM Bits" name="GPNVMBITS" offset="0x0" rw="RW" size="2">
          <bitfield caption="Security Bit" mask="0x00000001" name="SECURITY_BIT" rw="R"/>
          <bitfield caption="Boot Mode Selection" mask="0x00000002" name="BOOT_MODE"/>
          <bitfield caption="TCM Configuration" mask="0x00000180" name="TCM_CONFIGURATION"/>
        </register>
      </register-group>
    </module>
    <module name="LOCKBIT" id="1" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits" name="LOCKBIT" offset="0x0" rw="RW" size="4">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
          <bitfield caption="Lock Region 16" mask="0x00010000" name="LOCK_REGION_16"/>
          <bitfield caption="Lock Region 17" mask="0x00020000" name="LOCK_REGION_17"/>
          <bitfield caption="Lock Region 18" mask="0x00040000" name="LOCK_REGION_18"/>
          <bitfield caption="Lock Region 19" mask="0x00080000" name="LOCK_REGION_19"/>
          <bitfield caption="Lock Region 20" mask="0x00100000" name="LOCK_REGION_20"/>
          <bitfield caption="Lock Region 21" mask="0x00200000" name="LOCK_REGION_21"/>
          <bitfield caption="Lock Region 22" mask="0x00400000" name="LOCK_REGION_22"/>
          <bitfield caption="Lock Region 23" mask="0x00800000" name="LOCK_REGION_23"/>
          <bitfield caption="Lock Region 24" mask="0x01000000" name="LOCK_REGION_24"/>
          <bitfield caption="Lock Region 25" mask="0x02000000" name="LOCK_REGION_25"/>
          <bitfield caption="Lock Region 26" mask="0x04000000" name="LOCK_REGION_26"/>
          <bitfield caption="Lock Region 27" mask="0x08000000" name="LOCK_REGION_27"/>
          <bitfield caption="Lock Region 28" mask="0x10000000" name="LOCK_REGION_28"/>
          <bitfield caption="Lock Region 29" mask="0x20000000" name="LOCK_REGION_29"/>
          <bitfield caption="Lock Region 30" mask="0x40000000" name="LOCK_REGION_30"/>
          <bitfield caption="Lock Region 31" mask="0x80000000" name="LOCK_REGION_31"/>
        </register>
      </register-group>
    </module>
    <module name="DACC" caption="Digital-to-Analog Converter Controller" id="11246" version="D">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Max Speed Mode for Channel 0" mask="0x00000001" name="MAXS0" values="DACC_MR__MAXS0"/>
          <bitfield caption="Max Speed Mode for Channel 1" mask="0x00000002" name="MAXS1" values="DACC_MR__MAXS1"/>
          <bitfield caption="Word Transfer Mode" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Must always be written to 0." mask="0x00000020" name="ZERO"/>
          <bitfield caption="Differential Mode" mask="0x00800000" name="DIFF" values="DACC_MR__DIFF"/>
          <bitfield caption="Peripheral Clock to DAC Clock Ratio" mask="0x0F000000" name="PRESCALER"/>
        </register>
        <register caption="Trigger Register" name="DACC_TRIGR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Trigger Enable of Channel 0" mask="0x00000001" name="TRGEN0" values="DACC_TRIGR__TRGEN0"/>
          <bitfield caption="Trigger Enable of Channel 1" mask="0x00000002" name="TRGEN1" values="DACC_TRIGR__TRGEN1"/>
          <bitfield caption="Trigger Selection of Channel 0" mask="0x00000070" name="TRGSEL0" values="DACC_TRIGR__TRGSEL0"/>
          <bitfield caption="Trigger Selection of Channel 1" mask="0x00000700" name="TRGSEL1" values="DACC_TRIGR__TRGSEL1"/>
          <bitfield caption="Over Sampling Ratio of Channel 0" mask="0x00070000" name="OSR0" values="DACC_TRIGR__OSR0"/>
          <bitfield caption="Over Sampling Ratio of Channel 1" mask="0x00700000" name="OSR1" values="DACC_TRIGR__OSR1"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:DACC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:DACC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000100" name="DACRDY0"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000200" name="DACRDY1"/>
        </register>
        <register caption="Conversion Data Register 0" name="DACC_CDR" offset="0x1C" rw="W" size="4" count="2">
          <bitfield caption="Data to Convert for channel 0" mask="0x0000FFFF" name="DATA0"/>
          <bitfield caption="Data to Convert for channel 1" mask="0xFFFF0000" name="DATA1"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Enable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Disable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
